RT-Thread/rt-thread/bsp/fm33lc026/libraries/FM33LC0xx_FL_Driver/Src/fm33lc0xx_fl_atim.c
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_fl_atim.c
  * @author  FMSH Application Team
  * @brief   Src file of ATIM FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "fm33lc0xx_fl_rcc.h"
#include "fm33lc0xx_fl_rmu.h"
#include "fm33lc0xx_fl_atim.h"
#include "fm33_assert.h"

/** @addtogroup FM33LC0XX_FL_Driver
  * @{
  */

/** @addtogroup ATIM
  * @{
  */

/* Private macros ------------------------------------------------------------------*/
/** @addtogroup ATIM_FL_Private_Macros
  * @{
  */


#define IS_ATIM_INSTANCE(TIMx)                     ((TIMx) == ATIM)

#define IS_ATIM_CLKSRC(__VALUE__)                  (((__VALUE__) == FL_RCC_ATIM_CLK_SOURCE_APB2CLK ) \
                                                      || ((__VALUE__) == FL_RCC_ATIM_CLK_SOURCE_PLLx2))\
                                                      || ((__VALUE__) == FL_RCC_ATIM_CLK_SOURCE_USBPHYBCK120M)


#define IS_FL_ATIM_COUNTERMODE(__VALUE__)          (((__VALUE__) == FL_ATIM_COUNTER_DIR_UP) \
                                                       || ((__VALUE__) == FL_ATIM_COUNTER_DIR_DOWN) \
                                                       || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_DOWN   ) \
                                                       || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_UP     ) \
                                                       || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN))

#define IS_FL_ATIM_CLOCKDIVISION(__VALUE__)        (((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV1) \
                                                     || ((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV2) \
                                                     || ((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV4))


#define IS_FL_ATIM_CC_MODE(__VALUE__)               (((__VALUE__) ==   FL_ATIM_CHANNEL_MODE_OUTPUT) \
                                                      || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_NORMAL) \
                                                      || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_CROSSOVER) \
                                                      || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_TRC))

#define IS_FL_ATIM_IC_FILTER(__VALUE__)            (((__VALUE__) == FL_ATIM_IC_FILTER_DIV1 ) \
                                                     || ((__VALUE__) ==FL_ATIM_IC_FILTER_DIV1_N2) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV1_N4) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV1_N8) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV2_N6) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV2_N8) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV4_N6) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV4_N8) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV8_N6) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV8_N8) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N5) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N6) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N8) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N5) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N6) \
                                                     || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N8))

#define IS_FL_ATIM_CHANNEL(__VALUE__)              (((__VALUE__) == FL_ATIM_CHANNEL_1)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_2)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_3)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_4))



#define IS_FL_ATIM_SLAVE_MODE(__VALUE__)           (((__VALUE__) == FL_ATIM_SLAVE_MODE_PROHIBITED)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X2_TI1)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X2_TI2)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X4_TI1TI2)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_RISE_RST)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_HIGH_RUN)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_RISE_RUN)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_CLK))


#define IS_FL_ATIM_TRIGGER_SRC(__VALUE__)          (((__VALUE__) == FL_ATIM_TRGI_ITR0 )\
                                                        ||((__VALUE__) ==FL_ATIM_TRGI_ITR1 )\
                                                        ||((__VALUE__) ==FL_ATIM_TRGI_ITR2)\
                                                        ||((__VALUE__) ==FL_ATIM_TRGI_ITR3)\
                                                        ||((__VALUE__) ==FL_ATIM_TRGI_TI1F_EDGE)\
                                                        ||((__VALUE__) ==FL_ATIM_TRGI_TI1FP1)\
                                                        ||((__VALUE__) ==FL_ATIM_TRGI_TI2FP2)\
                                                        ||((__VALUE__) ==FL_ATIM_TRGI_ETRF))



#define IS_FL_ATIM_ETP_FILTER(__VALUE__)           (((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N2) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N4) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N8) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV2_N6) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV2_N8) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV4_N6) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV4_N8) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV8_N6) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV8_N8) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N5) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N6) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N8) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N5) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N6) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N8))


